keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMcds_regdef.h
/** \\brief  Comparator Sign Register */
typedef struct _Ifx_MCDS_TCXWD_SGN_Bits
{
    Ifx_Strict_32Bit SIGN:6;                /**< \brief [5:0] Bit number (1...63) of sign bit (rw) */
    Ifx_Strict_32Bit reserved_6:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EITHER:1;              /**< \brief [14:14] RANGE matching either side of BOUND (rw) */
    Ifx_Strict_32Bit BELOW:1;               /**< \brief [15:15] RANGE matching lower side of BOUND (rw) */
    Ifx_Strict_32Bit RELOAD:4;              /**< \brief [19:16] Reload Event Selector (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_MCDS_TCXWD_SGN_Bits;

/** \\brief  Clock Counter Register */
typedef struct _Ifx_MCDS_TSUEMUCNT_Bits
{
    Ifx_Strict_32Bit COUNT:32;              /**< \brief [31:0] Current Count Value (rh) */
} Ifx_MCDS_TSUEMUCNT_Bits;

/** \\brief  Clock Prescaler Register */
typedef struct _Ifx_MCDS_TSUPRSCL_Bits
{
    Ifx_Strict_32Bit RELOAD:32;             /**< \brief [31:0] Prescaler Reload Value (rw) */
} Ifx_MCDS_TSUPRSCL_Bits;

/** \\brief  Clock Counter Register */
typedef struct _Ifx_MCDS_TSUREFCNT_Bits
{
    Ifx_Strict_32Bit COUNT:32;              /**< \brief [31:0] Current Count Value (rh) */
} Ifx_MCDS_TSUREFCNT_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mcds_union
 * \{  */

/** \\brief  Action Definition Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_ACT_Bits B;
} Ifx_MCDS_ACT;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_CLC_Bits B;
} Ifx_MCDS_CLC;

/** \\brief  Counter Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_CNT_CCL_Bits B;
} Ifx_MCDS_CNT_CCL;

/** \\brief  Current Count Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_CNT_CNT_Bits B;
} Ifx_MCDS_CNT_CNT;

/** \\brief  Counter Limit Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_CNT_LMT_Bits B;
} Ifx_MCDS_CNT_LMT;

/** \\brief  MCDS Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_CT_Bits B;
} Ifx_MCDS_CT;

/** \\brief  Event Definition Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_EVT_Bits B;
} Ifx_MCDS_EVT;

/** \\brief  Trace Buffer Bottom Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFOBOT_Bits B;
} Ifx_MCDS_FIFOBOT;

/** \\brief  Trace Buffer Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFOCTL_Bits B;
} Ifx_MCDS_FIFOCTL;

/** \\brief  Trace Buffer Write Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFONOW_Bits B;
} Ifx_MCDS_FIFONOW;

/** \\brief  Trace Buffer PRE/POST Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFOPRE_Bits B;
} Ifx_MCDS_FIFOPRE;

/** \\brief  Trace Buffer Top Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFOTOP_Bits B;
} Ifx_MCDS_FIFOTOP;

/** \\brief  Trace Buffer Comparator Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFOWARN0_Bits B;
} Ifx_MCDS_FIFOWARN0;

/** \\brief  Trace Buffer Comparator Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_FIFOWARN1_Bits B;
} Ifx_MCDS_FIFOWARN1;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_ID_Bits B;
} Ifx_MCDS_ID;

/** \\brief  MCDS Signal Source Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_MUX_Bits B;
} Ifx_MCDS_MUX;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_OCS_Bits B;
} Ifx_MCDS_OCS;

/** \\brief  Current Instruction Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCX_CIP_Bits B;
} Ifx_MCDS_TCX_CIP;

/** \\brief  Debug Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCX_DCSTS_Bits B;
} Ifx_MCDS_TCX_DCSTS;

/** \\brief  Compact Function Trace Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCX_TCCFTREG_Bits B;
} Ifx_MCDS_TCX_TCCFTREG;

/** \\brief  Comparator Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXEA_BND_Bits B;
} Ifx_MCDS_TCXEA_BND;

/** \\brief  Comparator Range Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXEA_RNG_Bits B;
} Ifx_MCDS_TCXEA_RNG;

/** \\brief  Comparator Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXIP_BND_Bits B;
} Ifx_MCDS_TCXIP_BND;

/** \\brief  Comparator Range Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXIP_RNG_Bits B;
} Ifx_MCDS_TCXIP_RNG;

/** \\brief  Comparator Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXWD_BND_Bits B;
} Ifx_MCDS_TCXWD_BND;

/** \\brief  Comparator Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXWD_MSK_Bits B;
} Ifx_MCDS_TCXWD_MSK;

/** \\brief  Comparator Range Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MCDS_TCXWD_RNG_Bits B;
} Ifx_MCDS_TCXWD_RNG;

